[NoCoverage] BlockStatement
src/device/controller/device.controller.ts:27:69
   constructor(private readonly deviceService: DeviceService) {}
 
   @Post()
-  async create(@Body() dto: CreateUpdateDeviceDTO): Promise<Device> {
-    return await this.deviceService.create(dto);
-  }
+  async create(@Body() dto: CreateUpdateDeviceDTO): Promise<Device> {}
 
   @Put(':id')

[NoCoverage] BlockStatement
src/device/controller/device.controller.ts:35:20
   async update(
     @Body() dto: CreateUpdateDeviceDTO,
     @Param('id') id: string,
-  ): Promise<void> {
-    return await this.deviceService.update(dto, id);
-  }
+  ): Promise<void> {}
 
   @Delete(':id')

[NoCoverage] BlockStatement
src/device/controller/device.controller.ts:40:56
   }
 
   @Delete(':id')
-  async delete(@Param('id') id: string): Promise<void> {
-    return await this.deviceService.delete(id);
-  }
+  async delete(@Param('id') id: string): Promise<void> {}
 
   @Get()

[NoCoverage] BlockStatement
src/device/controller/device.controller.ts:45:38
   }
 
   @Get()
-  async findAll(): Promise<Device[]> {
-    return await this.deviceService.findAll();
-  }
+  async findAll(): Promise<Device[]> {}
 
   @Get(':id')

[NoCoverage] BlockStatement
src/device/controller/device.controller.ts:50:46
   }
 
   @Get(':id')
-  async findOne(id: string): Promise<Device> {
-    return await this.deviceService.findOne(id);
-  }
+  async findOne(id: string): Promise<Device> {}
 }
 
