[Killed] BlockStatement
src/device/service/device.service.ts:22:49
 }
 
 // Função auxiliar para formatar a data no formato 'DD/MM/YY'
-function formatDate(dateString: string): string {
-  const date = DateTime.fromISO(dateString);
-  return date.toFormat('dd/LL/yy');
-}
+function formatDate(dateString: string): string {}
 
 @Injectable()
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,16 +1,16 @@
  Object {
    "address": "Address 1",

[NoCoverage] BlockStatement
src/device/service/device.service.ts:37:31
   ) {
     // TODO - Subscribe to MQTT topic of each one devices
     this.findAll().then((res) =>
-      res.forEach((device) => {
-        this.subscribe(device);
-      }),
+      res.forEach((device) => {}),
     );
   }

[Killed] BlockStatement
src/device/service/device.service.ts:43:61
     );
   }
 
-  async create(dto: CreateUpdateDeviceDTO): Promise<Device> {
-    await this.verifyMac(dto.mac);
-
-    const newDevice = await this.deviceRepository.save({ ...dto });
-
-    this.subscribe(newDevice);
-
-    return newDevice;
-  }
+  async create(dto: CreateUpdateDeviceDTO): Promise<Device> {}
 
   async update(dto: CreateUpdateDeviceDTO, id: string) {
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"address": "Address 1", "baseRadius": 1.6, "battery": 0, "devicesHistory": [], "height": 2, "id": "a3feaeae-0cac-48db-86d0-d66b70af7666", "mac": "00:11:22:33:44:55", "maxCapacity": 100000, "name": "Device 1", "percentage": 0, "water": 0}
Received: undefined

[Killed] ObjectLiteral
src/device/service/device.service.ts:46:56
   async create(dto: CreateUpdateDeviceDTO): Promise<Device> {
     await this.verifyMac(dto.mac);
 
-    const newDevice = await this.deviceRepository.save({ ...dto });
+    const newDevice = await this.deviceRepository.save({});
 
     this.subscribe(newDevice);
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "address": "Address 1",
-   "baseRadius": 1.6,

[Killed] BlockStatement
src/device/service/device.service.ts:53:56
     return newDevice;
   }
 
-  async update(dto: CreateUpdateDeviceDTO, id: string) {
-    const oldDevice = await this.deviceRepository.findOneOrFail({
-      where: { id },
-    });
-
-    if (oldDevice.mac !== dto.mac) {
-      await this.verifyMac(dto.mac);
-      await this.deviceRepository.update(id, dto);
-      const updateddevice = await this.findOne(id);
-      this.unsubscribe(oldDevice);
-      this.subscribe(updateddevice);
-    } else {
-      await this.deviceRepository.update(id, dto);
-    }
-  }
+  async update(dto: CreateUpdateDeviceDTO, id: string) {}
 
   async delete(id: string): Promise<void> {
killedBy: CRUD Operations update should update device and subscribe to MQTT topic if MAC is different
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"id": "a3feaeae-0cac-48db-86d0-d66b70af7666"}}

Number of calls: 0

[Timeout] ObjectLiteral
src/device/service/device.service.ts:54:65
   }
 
   async update(dto: CreateUpdateDeviceDTO, id: string) {
-    const oldDevice = await this.deviceRepository.findOneOrFail({
-      where: { id },
-    });
+    const oldDevice = await this.deviceRepository.findOneOrFail({});
 
     if (oldDevice.mac !== dto.mac) {

[Killed] ObjectLiteral
src/device/service/device.service.ts:55:14
 
   async update(dto: CreateUpdateDeviceDTO, id: string) {
     const oldDevice = await this.deviceRepository.findOneOrFail({
-      where: { id },
+      where: {},
     });
 
killedBy: CRUD Operations update should update device and subscribe to MQTT topic if MAC is different
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": "a3feaeae-0cac-48db-86d0-d66b70af7666",

[Killed] EqualityOperator
src/device/service/device.service.ts:58:9
       where: { id },
     });
 
-    if (oldDevice.mac !== dto.mac) {
+    if (oldDevice.mac === dto.mac) {
       await this.verifyMac(dto.mac);
       await this.deviceRepository.update(id, dto);
killedBy: CRUD Operations update should update device and subscribe to MQTT topic if MAC is different
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"address": "Address 1", "baseRadius": 1.6, "battery": 0, "devicesHistory": [], "height": 2, "id": "a3feaeae-0cac-48db-86d0-d66b70af7666", "mac": "11:22:33:44:55:66", "maxCapacity": 100000, "name": "Device 1", "percentage": 0, "water": 0}

Number of calls: 0

[Killed] BlockStatement
src/device/service/device.service.ts:64:12
       const updateddevice = await this.findOne(id);
       this.unsubscribe(oldDevice);
       this.subscribe(updateddevice);
-    } else {
-      await this.deviceRepository.update(id, dto);
-    }
+    } else {}
   }
 
killedBy: CRUD Operations update should update device and dont subscribe if MAC is same
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "a3feaeae-0cac-48db-86d0-d66b70af7666", {"address": "Address 1", "baseRadius": 1.6, "height": 2, "mac": "00:11:22:33:44:55", "maxCapacity": 100000, "name": "Device updated"}

Number of calls: 0

[Killed] BlockStatement
src/device/service/device.service.ts:79:49
     this.unsubscribe(device);
   }
 
-  async findByMac(mac: string): Promise<Device> {
-    return await this.deviceRepository.findOne({ where: { mac } });
-  }
+  async findByMac(mac: string): Promise<Device> {}
 
   async findAll(): Promise<Device[]> {
killedBy: CRUD Operations create should throw ConflictException if device with the same MAC already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"address": "Address 1", "baseRadius": "1.60", "battery": "0.00", "height": "2.00", "id": "be93ed35-e272-4158-bb47-8cf07847ded5", "mac": "00:11:22:33:44:55", "maxCapacity": 100000, "name": "Device 1", "percentage": "0.00", "water": "0.00"}

[Killed] BlockStatement
src/device/service/device.service.ts:93:40
     return devices.map((device) => this.mapDeviceToAggregatedHistory(device));
   }
 
-  findOne(id: string): Promise<Device> {
-    return this.deviceRepository.findOne({
-      where: { id },
-      relations: ['devicesHistory'],
-    });
-  }
+  findOne(id: string): Promise<Device> {}
 
   async verifyMac(mac: string): Promise<void> {
killedBy: CRUD Operations update should update device and subscribe to MQTT topic if MAC is different
statusReason: TypeError: Cannot read properties of undefined (reading 'mac')

[Killed] ObjectLiteral
src/device/service/device.service.ts:94:42
   }
 
   findOne(id: string): Promise<Device> {
-    return this.deviceRepository.findOne({
-      where: { id },
-      relations: ['devicesHistory'],
-    });
+    return this.deviceRepository.findOne({});
   }
 
killedBy: CRUD Operations findOne should return device with matching ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "relations": Array [
-     "devicesHistory",

[Killed] ObjectLiteral
src/device/service/device.service.ts:95:14
 
   findOne(id: string): Promise<Device> {
     return this.deviceRepository.findOne({
-      where: { id },
+      where: {},
       relations: ['devicesHistory'],
     });
killedBy: CRUD Operations findOne should return device with matching ID
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "relations": Array [
      "devicesHistory",

[Killed] BlockStatement
src/device/service/device.service.ts:100:47
     });
   }
 
-  async verifyMac(mac: string): Promise<void> {
-    const deviceAlreadyExists = await this.findByMac(mac);
-
-    if (deviceAlreadyExists) {
-      throw new ConflictException('Device already exists');
-    }
-  }
+  async verifyMac(mac: string): Promise<void> {}
 
   calcCurrentVolume(distance: number, device: Device): number {
killedBy: CRUD Operations create should throw ConflictException if device with the same MAC already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"address": "Address 1", "baseRadius": "1.60", "battery": "0.00", "height": "2.00", "id": "3505f567-c918-40a1-b55b-e9774b3e0fa3", "mac": "00:11:22:33:44:55", "maxCapacity": 100000, "name": "Device 1", "percentage": "0.00", "water": "0.00"}

[Killed] BlockStatement
src/device/service/device.service.ts:103:30
   async verifyMac(mac: string): Promise<void> {
     const deviceAlreadyExists = await this.findByMac(mac);
 
-    if (deviceAlreadyExists) {
-      throw new ConflictException('Device already exists');
-    }
+    if (deviceAlreadyExists) {}
   }
 
killedBy: CRUD Operations create should throw ConflictException if device with the same MAC already exists
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"address": "Address 1", "baseRadius": "1.60", "battery": "0.00", "height": "2.00", "id": "90e5891b-622a-4f41-8f2f-09c3456d3e02", "mac": "00:11:22:33:44:55", "maxCapacity": 100000, "name": "Device 1", "percentage": "0.00", "water": "0.00"}

[Killed] ConditionalExpression
src/device/service/device.service.ts:103:9
   async verifyMac(mac: string): Promise<void> {
     const deviceAlreadyExists = await this.findByMac(mac);
 
-    if (deviceAlreadyExists) {
+    if (true) {
       throw new ConflictException('Device already exists');
     }
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: ConflictException: Device already exists

[Killed] BlockStatement
src/device/service/device.service.ts:108:63
     }
   }
 
-  calcCurrentVolume(distance: number, device: Device): number {
-    const { height, baseRadius } = device;
-
-    const currentHeight = height - distance / 100;
-
-    const currentVolume = Math.PI * Math.pow(baseRadius, 2) * currentHeight;
-
-    return Number((currentVolume * 1000).toFixed(2));
-  }
+  calcCurrentVolume(distance: number, device: Device): number {}
 
   mapDeviceToAggregatedHistory(device: Device): DeviceWithAggregatedHistory {
killedBy: CRUD Operations calcCurrentVolume should calculate current volume based on distance and device properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12063.72
Received: undefined

[Killed] ArithmeticOperator
src/device/service/device.service.ts:111:27
   calcCurrentVolume(distance: number, device: Device): number {
     const { height, baseRadius } = device;
 
-    const currentHeight = height - distance / 100;
+    const currentHeight = height + distance / 100;
 
     const currentVolume = Math.PI * Math.pow(baseRadius, 2) * currentHeight;
killedBy: CRUD Operations calcCurrentVolume should calculate current volume based on distance and device properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12063.72
Received: 20106.19

[Killed] ArithmeticOperator
src/device/service/device.service.ts:111:36
   calcCurrentVolume(distance: number, device: Device): number {
     const { height, baseRadius } = device;
 
-    const currentHeight = height - distance / 100;
+    const currentHeight = height - distance * 100;
 
     const currentVolume = Math.PI * Math.pow(baseRadius, 2) * currentHeight;
killedBy: CRUD Operations calcCurrentVolume should calculate current volume based on distance and device properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12063.72
Received: -40196301.01

[Killed] ArithmeticOperator
src/device/service/device.service.ts:113:27
 
     const currentHeight = height - distance / 100;
 
-    const currentVolume = Math.PI * Math.pow(baseRadius, 2) * currentHeight;
+    const currentVolume = Math.PI / Math.pow(baseRadius, 2) * currentHeight;
 
     return Number((currentVolume * 1000).toFixed(2));
killedBy: CRUD Operations calcCurrentVolume should calculate current volume based on distance and device properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12063.72
Received: 1840.78

[Killed] ArithmeticOperator
src/device/service/device.service.ts:113:27
 
     const currentHeight = height - distance / 100;
 
-    const currentVolume = Math.PI * Math.pow(baseRadius, 2) * currentHeight;
+    const currentVolume = Math.PI * Math.pow(baseRadius, 2) / currentHeight;
 
     return Number((currentVolume * 1000).toFixed(2));
killedBy: CRUD Operations calcCurrentVolume should calculate current volume based on distance and device properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12063.72
Received: 5361.65

[Killed] BlockStatement
src/device/service/device.service.ts:122:75
     const aggregatedHistory: AggregatedDeviceHistory[] = [];
 
     // Agrupa o histórico por dia
-    const groupedHistory = device.devicesHistory.reduce((acc, history) => {
-      const date = DateTime.fromJSDate(history.timestamp).toISODate(); // Obtém a data em formato 'YYYY-MM-DD'
-      if (!acc[date]) {
-        acc[date] = [];
-      }
-      acc[date].push(history);
-      return acc;
-    }, {} as { [date: string]: DeviceHistory[] });
+    const groupedHistory = device.devicesHistory.reduce((acc, history) => {}, {} as { [date: string]: DeviceHistory[] });
 
     // Calcula o volume máximo de água e nível de bateria por dia
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

@@ -1,19 +1,8 @@
  Object {
    "address": "Address 1",

[Killed] BooleanLiteral
src/device/service/device.service.ts:124:11
     // Agrupa o histórico por dia
     const groupedHistory = device.devicesHistory.reduce((acc, history) => {
       const date = DateTime.fromJSDate(history.timestamp).toISODate(); // Obtém a data em formato 'YYYY-MM-DD'
-      if (!acc[date]) {
+      if (acc[date]) {
         acc[date] = [];
       }
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/device/service/device.service.ts:124:23
     // Agrupa o histórico por dia
     const groupedHistory = device.devicesHistory.reduce((acc, history) => {
       const date = DateTime.fromJSDate(history.timestamp).toISODate(); // Obtém a data em formato 'YYYY-MM-DD'
-      if (!acc[date]) {
-        acc[date] = [];
-      }
+      if (!acc[date]) {}
       acc[date].push(history);
       return acc;
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Survived] ArrayDeclaration
src/device/service/device.service.ts:125:21
     const groupedHistory = device.devicesHistory.reduce((acc, history) => {
       const date = DateTime.fromJSDate(history.timestamp).toISODate(); // Obtém a data em formato 'YYYY-MM-DD'
       if (!acc[date]) {
-        acc[date] = [];
+        acc[date] = ["Stryker was here"];
       }
       acc[date].push(history);

[Killed] BlockStatement
src/device/service/device.service.ts:132:40
     }, {} as { [date: string]: DeviceHistory[] });
 
     // Calcula o volume máximo de água e nível de bateria por dia
-    for (const date in groupedHistory) {
-      const historyList = groupedHistory[date];
-
-      aggregatedHistory.push({
-        date: formatDate(date),
-        volume: historyList[historyList.length - 1].water,
-        battery: historyList[historyList.length - 1].battery,
-      });
-    }
+    for (const date in groupedHistory) {}
 
     const deviceWithAggregatedHistory: DeviceWithAggregatedHistory = {
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

@@ -1,19 +1,8 @@
  Object {
    "address": "Address 1",

[Killed] ArithmeticOperator
src/device/service/device.service.ts:137:29
 
       aggregatedHistory.push({
         date: formatDate(date),
-        volume: historyList[historyList.length - 1].water,
+        volume: historyList[historyList.length + 1].water,
         battery: historyList[historyList.length - 1].battery,
       });
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: TypeError: Cannot read properties of undefined (reading 'water')

[Killed] ArithmeticOperator
src/device/service/device.service.ts:138:30
       aggregatedHistory.push({
         date: formatDate(date),
         volume: historyList[historyList.length - 1].water,
-        battery: historyList[historyList.length - 1].battery,
+        battery: historyList[historyList.length + 1].battery,
       });
     }
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: TypeError: Cannot read properties of undefined (reading 'battery')

[Killed] ObjectLiteral
src/device/service/device.service.ts:142:70
       });
     }
 
-    const deviceWithAggregatedHistory: DeviceWithAggregatedHistory = {
-      ...device,
-      aggregatedHistory,
-    };
+    const deviceWithAggregatedHistory: DeviceWithAggregatedHistory = {};
 
     return deviceWithAggregatedHistory;
killedBy: Mapper and Calc should map device with history to device with aggregated history
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 36
+ Received  +  1

- Object {
-   "address": "Address 1",
-   "aggregatedHistory": Array [

[NoCoverage] ArithmeticOperator
src/device/service/device.service.ts:158:10
       const currentVolume = this.calcCurrentVolume(dto.distance, device);
 
       const currentPercentage = (
-        (currentVolume * 100) /
+        (currentVolume / 100) /
         device.maxCapacity
       ).toFixed(2);

[NoCoverage] ArithmeticOperator
src/device/service/device.service.ts:158:9
       const currentVolume = this.calcCurrentVolume(dto.distance, device);
 
       const currentPercentage = (
-        (currentVolume * 100) /
-        device.maxCapacity
+        currentVolume * 100 * device.maxCapacity
       ).toFixed(2);
 

[NoCoverage] ObjectLiteral
src/device/service/device.service.ts:166:40
         `Receiving update from ${device.mac} - currentVolume: ${currentVolume} - currentPercentage: ${currentPercentage}`,
       );
 
-      this.deviceHistoryService.create({
-        volume: Number(currentVolume),
-        battery: Number(dto.battery),
-        timestamp: new Date(dto.timestamp * 1000),
-        device,
-      });
+      this.deviceHistoryService.create({});
       this.deviceRepository.update(device.id, {
         percentage: Number(currentPercentage),

[NoCoverage] ArithmeticOperator
src/device/service/device.service.ts:169:29
       this.deviceHistoryService.create({
         volume: Number(currentVolume),
         battery: Number(dto.battery),
-        timestamp: new Date(dto.timestamp * 1000),
+        timestamp: new Date(dto.timestamp / 1000),
         device,
       });

[NoCoverage] ObjectLiteral
src/device/service/device.service.ts:172:47
         timestamp: new Date(dto.timestamp * 1000),
         device,
       });
-      this.deviceRepository.update(device.id, {
-        percentage: Number(currentPercentage),
-        battery: Number(dto.battery),
-        water: Number(currentVolume),
-      });
+      this.deviceRepository.update(device.id, {});
     });
   }
