[NoCoverage] BlockStatement
src/main.ts:4:28
 import { NestFactory } from '@nestjs/core';
 import { AppModule } from './app.module';
 
-async function bootstrap() {
-  const app = await NestFactory.create(AppModule, { cors: true });
-  await app.listen(3001);
-}
+async function bootstrap() {}
 bootstrap();
 

[NoCoverage] ObjectLiteral
src/main.ts:5:51
 import { AppModule } from './app.module';
 
 async function bootstrap() {
-  const app = await NestFactory.create(AppModule, { cors: true });
+  const app = await NestFactory.create(AppModule, {});
   await app.listen(3001);
 }
