[Killed] ArrayDeclaration
src/mqtt/mqtt.service.ts:14:13
       'mqtt://f9ca89e3f5df46e6a4b2e122b2d56a3c.s2.eu.hivemq.cloud:8883',
       {
         protocol: 'mqtts', // Indica que a conexão deve usar TLS
-        ca: [fs.readFileSync('src/mqtt/cert.pem')], // Caminho para o certificado de autoridade (CA) do broker MQTT
+        ca: [], // Caminho para o certificado de autoridade (CA) do broker MQTT
         rejectUnauthorized: true, // Rejeita conexões com certificados inválidos (opcional)
         username: 'username',
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: ConflictException: Device already exists

[Killed] BooleanLiteral
src/mqtt/mqtt.service.ts:15:29
       {
         protocol: 'mqtts', // Indica que a conexão deve usar TLS
         ca: [fs.readFileSync('src/mqtt/cert.pem')], // Caminho para o certificado de autoridade (CA) do broker MQTT
-        rejectUnauthorized: true, // Rejeita conexões com certificados inválidos (opcional)
+        rejectUnauthorized: false, // Rejeita conexões com certificados inválidos (opcional)
         username: 'username',
         password: '@MQTT-password1',
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: ConflictException: Device already exists

[Killed] StringLiteral
src/mqtt/mqtt.service.ts:17:19
         ca: [fs.readFileSync('src/mqtt/cert.pem')], // Caminho para o certificado de autoridade (CA) do broker MQTT
         rejectUnauthorized: true, // Rejeita conexões com certificados inválidos (opcional)
         username: 'username',
-        password: '@MQTT-password1',
+        password: "",
       },
     );
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: ConflictException: Device already exists

[NoCoverage] BlockStatement
src/mqtt/mqtt.service.ts:21:37
       },
     );
 
-    this.client.on('connect', () => {
-      console.log('Conectado ao broker MQTT');
-    });
+    this.client.on('connect', () => {});
   }
 

[Killed] StringLiteral
src/mqtt/mqtt.service.ts:21:20
       },
     );
 
-    this.client.on('connect', () => {
+    this.client.on("", () => {
       console.log('Conectado ao broker MQTT');
     });
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: ConflictException: Device already exists

[Killed] BlockStatement
src/mqtt/mqtt.service.ts:26:65
     });
   }
 
-  subscribe(topic: string, callback: (message: string) => void) {
-    this.client.subscribe(topic);
-    this.client.on('message', (t, message) => {
-      if (t === topic) {
-        console.log(
-          `Mensagem recebida no tópico ${topic}: ${message.toString()}`,
-        );
-        callback(message.toString());
-      }
-    });
-  }
+  subscribe(topic: string, callback: (message: string) => void) {}
 
   unsubscribe(topic: string) {
killedBy: CRUD Operations create should create a new device and subscribe to MQTT topic
statusReason: ConflictException: Device already exists

[NoCoverage] BlockStatement
src/mqtt/mqtt.service.ts:28:47
 
   subscribe(topic: string, callback: (message: string) => void) {
     this.client.subscribe(topic);
-    this.client.on('message', (t, message) => {
-      if (t === topic) {
-        console.log(
-          `Mensagem recebida no tópico ${topic}: ${message.toString()}`,
-        );
-        callback(message.toString());
-      }
-    });
+    this.client.on('message', (t, message) => {});
   }
 

[NoCoverage] ConditionalExpression
src/mqtt/mqtt.service.ts:29:11
   subscribe(topic: string, callback: (message: string) => void) {
     this.client.subscribe(topic);
     this.client.on('message', (t, message) => {
-      if (t === topic) {
+      if (false) {
         console.log(
           `Mensagem recebida no tópico ${topic}: ${message.toString()}`,

[NoCoverage] BlockStatement
src/mqtt/mqtt.service.ts:29:24
   subscribe(topic: string, callback: (message: string) => void) {
     this.client.subscribe(topic);
     this.client.on('message', (t, message) => {
-      if (t === topic) {
-        console.log(
-          `Mensagem recebida no tópico ${topic}: ${message.toString()}`,
-        );
-        callback(message.toString());
-      }
+      if (t === topic) {}
     });
   }

[NoCoverage] StringLiteral
src/mqtt/mqtt.service.ts:31:11
     this.client.on('message', (t, message) => {
       if (t === topic) {
         console.log(
-          `Mensagem recebida no tópico ${topic}: ${message.toString()}`,
+          ``,
         );
         callback(message.toString());
