[Killed] BlockStatement
src/device/service/device-history.service.ts:19:30
     battery: number;
     timestamp: Date;
     device: Device;
-  }): Promise<DeviceHistory> {
-    return await this.deviceHisotryRepository.save({
-      water: dto.volume,
-      battery: dto.battery,
-      timestamp: dto.timestamp,
-      device: dto.device,
-    });
-  }
+  }): Promise<DeviceHistory> {}
 }
 
killedBy: DeviceHistoryService create should create a new device history
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ObjectLiteral
src/device/service/device-history.service.ts:20:52
     timestamp: Date;
     device: Device;
   }): Promise<DeviceHistory> {
-    return await this.deviceHisotryRepository.save({
-      water: dto.volume,
-      battery: dto.battery,
-      timestamp: dto.timestamp,
-      device: dto.device,
-    });
+    return await this.deviceHisotryRepository.save({});
   }
 }
killedBy: DeviceHistoryService create should create a new device history
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "battery": 80,
-   "device": Device {},
